# InvisibleRoomBoundElemement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..InvisibleRoomBoundElemement Property
BuiltInFailures..::..RoomFailures Class See Also
---
[Room] Bounding element is invisible in current view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvisibleRoomBoundElemement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvisibleRoomBoundElemement As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvisibleRoomBoundElemement {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace